<template>
  <v-card color="grey-lighten-3">
    <v-container>
      <v-sheet class="pa-12 ">
        <v-col>
          <v-row class="d-flex mb-6 align-center ">
            <v-img src="@/assets/black.jpg" max-width="100"></v-img>
            <h1>ทริป low carbon สมาคม TEATA</h1>
            <v-img class="ml-auto" src="@/assets/point.jpg" max-width="250"></v-img>
          </v-row>
          <v-row class="d-flex">
            <v-col cols="12" md="6">
              <v-img src="@/assets/w1_1.jpg" max-width="600"></v-img>
            </v-col>
            <v-col cols="12" md="6">
              <v-card class="mx-auto" max-width="344">
                <v-card-text>
                  <span class="span1">1,000</span>
                  <span class="p3">&nbsp&nbsp&nbspบาท/ท่าน</span>
                  <p class="p3">จังหวัดกระบี่</p>
                  <p class="p3">วันที่ 1 ม.ค. 66 </p>
                  <p class="p3">ระยะเวลา ครึ่งวัน</p>
                  <p class="p3">จำนวนผู้เข้าร่วม 10-25 ท่าน</p>
                  <v-btn class="btn mt-8" width="400">
                    <p class="btn-p">จองเลย</p>
                  </v-btn>
                </v-card-text>
              </v-card>
            </v-col>
          </v-row>
          <h3>รายละเอียด และสิ่งที่คุณจะได้รับ</h3>
          <p class="p1 mt-3">กิจกรรมในทริปช่วยลด Carbon footprint ทั้งหมด 20 tCO2e ได้รับ Earth Poins 20 คะแนน</p>
          <p>ชุมชนท่องเที่ยวเชิงอนุรักษ์ ทุ่งหยีเพ็ง ที่บป่านบวก บนเกาะลิบตาได้เห็นความสร้างสรรค์ในการใช้ใบไม้ใหญ่
            ปูแทนพลาสติกรองจาน<br>ทาบจบรวบใบไม้ใหญ่พร้อมเศษก้างหรือกระดูกเหลือจากการทานไปลงหลุมทำปุ๋ยอินทรีย์ได้เลยชาวบ้านทำ
            ชาใบสำเพ็ง<br>และใบขลู่มาเสริฟมาให้จิ้มทานกับน้ำพริกและกะปิรสอร่อย มีกิจกรรมพาทำด้านศิลปะ และการทำ
            คลาสเรียนด้านอาหาร<br>ทำชาดื่มกันอย่างน่ารักน่าลองทำ กิจกรรมไฮไลท์ บอกจานอาหารสร้างสรรค์ที่นี่ คือการที่ชุมชน
            เรือยืนแจว<br> local Carbon เป็นการท่องเที่ยวชุมชนที่นักท่องเทียวส่วนหนึ่งในการรักษาสิ่งแงดล้อม
            ได้ช่วยการเกิดแก๊ชเรือนกระจก
          </p>
          <ul>
            <li>อาหารตามที่ระบุในรายการ (เช้า 1 มื้อ, กลางวัน 1 มื้อ)</li>
            <li>ยานพาหนะตามที่ระบุในรายการ</li>
            <li>กิจกรรมตามที่ระบุไว้ในโปรแกรม</li>
            <li>มัคคุเทศก์นำเที่ยวและทีมงาน TAETA</li>
          </ul>
          <h3>เงื่อนไข</h3>
          <ul>
            <li>ยกเลิกการเดินทางขอสงวนสิทธิ์ในการคืนมัดจำทุกกรณี</li>
            <li>ยกเลิกก่อนการเดินทาง 15-20 วัน เก็บค่าบริการ 50% ของราคาทัวร์ และค่าใช้จ่ายที่เกิดขึ้นจริง</li>
            <li>ยกเลิกก่อนการเดินทาง 1-14 วัน ขอสงวนสิทธิ์เก็บค่าบริการเต็มจำนวนราคาทัวร์</li>
            <li>เลื่อนการเดินทาง แจ้งเลื่อนได้ 1 ครั้ง ภายใน 90 วันและต้องแจ้งให้ทราบไปน้อยกว่า 45 วันเดินทาง</li>
            <li>เปลี่ยนผู้เดินทาง ต้องแจ้งให้ทราบไม่น้อยกว่า 21 วันก่อนวันเดินทาง</li>
          </ul>
          <h3>กิจกรรม Organic</h3>
          <p>08.00 น. ร้านดอลล่าแลนด์ Concept หุงข้าวครั้งเดียวทำอาหารได้ 8 เมนูเพื่อการลดการใช้เชื้อเพลิงดังนี้</p>
          <ul class="ul2">
            <li>กาแฟหมบา น้ำข้าว</li>
            <li>การแฟหมวย น้ำข้างหอมบอบ การแฟดริฟ</li>
            <li>ข้าวต้มท็อปปิ้งเห็ดแครง</li>
            <li>ขนมแหมข้าว ใบขะพลู พริก มะนาว</li>
            <li>ข้าวหอมมะลิ พันธุ์หอมบอบเป็นข้าวในท่องถิ่ยเพื่อลดการขนส่ง +กะทิ +น้ำผึ้งพื้นที่(น้ำขบเงิย สีเข้ม<br>
              รสชาติเข้มกว่า, หลังลาย สีอ่อย รสชาติอ่อนกว่า) +มะม่วงหิมพานต์ +มะพร้าวงา</li>
            <li>ไอตืมโฮมคั่ว รสข้าวกล้อง</li>
            <li>ชาข้าวคั่ว น้ำผึ้งชันโรงพันธุ์หลังลาย</li>
          </ul>
          <p class="mt-4">12.00 น. ณสุข เวลเมล รีสอร์ท แอน Concept ใช้ในสิกในทั้งเอามาแทนจาน เมนูอาหารมีดังนี้</p>
          <ul class="ul2 mb-12">
            <li>หมูแกงงาน</li>
            <li>น้ำพริกปลาจิ้งจ้าง</li>
            <li>แกงมะพร้าวคั่ว</li>
            <li>ข้าวยำสมุนไพร</li>
            <li>แกงบวชกระเทียม</li>
            <li>ข้าวกล้อง</li>
          </ul>
        </v-col>
      </v-sheet>
    </v-container>
  </v-card>
</template>

<script lang="ts" setup>


</script>

<style scoped>
h3 {
  color: #2E8E69;
  margin-top: 30px;
  margin-bottom: 20px;
  font-size: 20px;
}

.p1 {
  font-weight: bold;
}

ul {
  margin-left: 40px;
  line-height: 30px;
}

.ul2 {
  margin-left: 80px;
}

.span1 {
  color: #2E8E69;
  font-size: 20px;
  line-height: 40px;
}

.p3 {
  font-size: 16px;
  line-height: 30px;
}

.btn {
  background-color: #2E8E69;
}

.btn-p {
  color: white;
  font-size: 20px;
}

p {
  line-height: 30px;
}
</style>
